<?php
	$url = $_SERVER['REQUEST_URI'];
	$dirname = dirname($url);
	$way = preg_split("/\//", $dirname);
	if ($way[count($way)-1]=="writeNumber")
		echo numberOfWords(basename($url));
	else if ($way[count($way)-1]=="fibonacci")
		echo fibonacci(basename($url));
	else if ($way[count($way)-1]=="region")
		echo regionOfRussia(basename($url));
	else if (isset($_GET["a"])&&isset($_GET["b"])&&isset($_GET["c"]))
		echo equation($_GET["a"], $_GET["b"], $_GET["c"]);
	else if (isset($_GET["date"]))
		echo dayOfWeek($_GET["date"]);

	function numberOfWords($number) {
		if (strlen($number)>12)
			return "Такого числа я не знаю, оно слишком большое";
		$nul='ноль';
		$ten=array(
			array('','один','два','три','четыре','пять','шесть','семь', 'восемь','девять'),
			array('','одна','две','три','четыре','пять','шесть','семь', 'восемь','девять'),
		);
		$a20=array('десять','одиннадцать','двенадцать','тринадцать','четырнадцать' ,'пятнадцать','шестнадцать','семнадцать','восемнадцать','девятнадцать');
		$tens=array(2=>'двадцать','тридцать','сорок','пятьдесят','шестьдесят','семьдесят' ,'восемьдесят','девяносто');
		$hundred=array('','сто','двести','триста','четыреста','пятьсот','шестьсот', 'семьсот','восемьсот','девятьсот');
		$unit=array(
			array('копейка' ,'копейки' ,'копеек',	 1),
			array('рубль'   ,'рубля'   ,'рублей'    ,0),
			array('тысяча'  ,'тысячи'  ,'тысяч'     ,1),
			array('миллион' ,'миллиона','миллионов' ,0),
			array('миллиард','милиарда','миллиардов',0),
		);
		while (strlen($number)<12)
			$number="0".$number;
		$out = array();
		foreach(str_split($number,3) as $key=>$value) 
		{ 
			if (!intval($value)) 
				continue;
			$key = sizeof($unit)-$key-1; 
			$gender = $unit[$key][3];
			list($i1,$i2,$i3) = array_map('intval',str_split($value,1));
			$out[] = $hundred[$i1]; 
			if ($i2>1) 
				$out[]= $tens[$i2].' '.$ten[$gender][$i3];
			else 
				$out[]= $i2>0 ? $a20[$i3] : $ten[$gender][$i3]; 
			if ($key>1) 
				$out[]= declinations($value,$unit[$key][0],$unit[$key][1],$unit[$key][2]);
		}
		$text="";
		for ($i=0; $i<count($out); $i++)
			$text.=$out[$i]." ";
		return $text;
	}
	
	function declinations($n, $f1, $f2, $f5) {
		$n = abs(intval($n)) % 100;
		if ($n>10 && $n<20) return $f5;
		$n = $n % 10;
		if ($n>1 && $n<5) return $f2;
		if ($n==1) return $f1;
		return $f5;
	}
	
	function equation($a, $b, $c){
		$x1; $x2;
		$D=$b*$b-4*$a*$c;
		if ($D<0)
			return "Корней нет";
		else 
		{
			$x1=floor(-1*$b+sqrt($D))/floor(2*$a);
			if ($D==0)
			{
				return "x=$x1";
			}
			else
			{
				$x2=floor(-1*$b-sqrt($D))/floor(2*$a);
				return "x1=$x1, x2=$x2";
			}
		}
	}
	
	function dayOfWeek($date){
		$day = date("w", strtotime($date));
		$name = array ("Воскресенье", "Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота");
		return $name[$day];
	}
	
	function fibonacci($number){
		if ($number==0)
			return 0;
		else if ($number<0)
		{
			return fibonacci($number+2)-fibonacci($number+1);
		}
		 else if($number == 1 || $number==2)
		{
			return 1;
		}
		else
		{
			return fibonacci($number-2)+fibonacci($number-1);
		}
	}
	
	function regionOfRussia($number){
		$regions = [
			'1' => 'Республика Адыгея',
			'2' => 'Республика Башкортостан',
			'3' => 'Республика Бурятия',
			'4' => 'Республика Алтай',
			'5' => 'Республика Дагестан',
			'6' => 'Республика Ингушетия',
			'7' => 'Кабардино-Балкарская Республика',
			'8' => 'Республика Калмыкия',
			'9' => 'Карачаево-Черкесская Республика',
			'10' => 'Республика Карелия',
			'11' => 'Республика Коми',
			'12' => 'Республика Марий Эл',
			'13' => 'Республика Мордовия',
			'14' => 'Республика Саха (Якутия)',
			'15' => 'Республика Северная Осетия - Алания',
			'16' => 'Республика Татарстан',
			'17' => 'Республика Тыва',
			'18' => 'Удмуртская Республика',
			'19' => 'Республика Хакасия',
			'20' => 'Чеченская республика',
			'21' => 'Чувашская Республика',
			'22' => 'Алтайский край',
			'23' => 'Краснодарский край',
			'24' => 'Красноярский край',
			'25' => 'Приморский край',
			'26' => 'Ставропольский край',
			'27' => 'Хабаровский край',
			'28' => 'Амурская область',
			'29' => 'Архангельская область',
			'30' => 'Астраханская область',
			'31' => 'Белгородская область',
			'32' => 'Брянская область',
			'33' => 'Владимирская область',
			'34' => 'Волгоградская область',
			'35' => 'Вологодская область',
			'36' => 'Воронежская область',
			'37' => 'Ивановская область',
			'38' => 'Иркутская область',
			'39' => 'Калининградская область',
			'40' => 'Калужская область',
			'41' => 'Камчатский край',
			'42' => 'Кемеровская область',
			'43' => 'Кировская область',
			'44' => 'Костромская область',
			'45' => 'Курганская область',
			'46' => 'Курская область',
			'47' => 'Ленинградская область',
			'48' => 'Липецкая область',
			'49' => 'Магаданская область',
			'50' => 'Московская область',
			'51' => 'Мурманская область',
			'52' => 'Нижегородская область',
			'53' => 'Новгородская область',
			'54' => 'Новосибирская область',
			'55' => 'Омская область',
			'56' => 'Оренбургская область',
			'57' => 'Орловская область',
			'58' => 'Пензенская область',
			'59' => 'Пермский край',
			'60' => 'Псковская область',
			'61' => 'Ростовская область',
			'62' => 'Рязанская область',
			'63' => 'Самарская область',
			'64' => 'Саратовская область',
			'65' => 'Сахалинская область',
			'66' => 'Свердловская область',
			'67' => 'Смоленская область',
			'68' => 'Тамбовская область',
			'69' => 'Тверская область',
			'70' => 'Томская область',
			'71' => 'Тульская область',
			'72' => 'Тюменская область',
			'73' => 'Ульяновская область',
			'74' => 'Челябинская область',
			'75' => 'Забайкальский край',
			'76' => 'Ярославская область',
			'77' => 'Москва',
			'78' => 'Санкт-Петербург',
			'79' => 'Еврейская автономная область',
			'80' => 'Забайкальский край',
			'81' => 'Пермский край',
			'82' => 'Республика Крым',
			'83' => 'Ненецкий автономный округ',
			'84' => 'Красноярский край',
			'85' => 'Иркутская область',
			'86' => 'Ханты-Мансийский АО',
			'87' => 'Чукотский автономный округ',
			'88' => 'Красноярский край',
			'89' => 'Ямало-Ненецкий автономный округ',
			'90' => 'Московская область',
			'91' => 'Калининградская область',
			'92' => 'Севастополь',
			'93' => 'Краснодарский край',
			'94' => 'Байконур',
			'95' => 'Чеченская республика',
			'96' => 'Свердловская область',
			'97' => 'Москва',
			'98' => 'Санкт-Петербург',
			'99' => 'Москва',
			'101' => 'Республика Адыгея',
			'102' => 'Республика Башкортостан',
			'103' => 'Республика Бурятия',
			'109' => 'Карачаево-Черкесская Республика',
			'111' => 'Республика Коми',
			'113' => 'Республика Мордовия',
			'116' => 'Республика Татарстан',
			'118' => 'Удмуртская Республика',
			'121' => 'Чувашская Республика',
			'123' => 'Краснодарский край',
			'124' => 'Красноярский край',
			'125' => 'Приморский край',
			'126' => 'Ставропольский край',
			'134' => 'Волгоградская область',
			'136' => 'Воронежская область',
			'138' => 'Иркутская область',
			'142' => 'Кемеровская область',
			'150' => 'Московская область ',
			'152' => 'Нижегородская область',
			'154' => 'Новосибирская область',
			'159' => 'Пермский край',
			'161' => 'Ростовская область',
			'163' => 'Самарская область',
			'164' => 'Саратовская область',
			'173' => 'Ульяновская область',
			'174' => 'Челябинская область',
			'176' => 'Ярославская область',
			'177' => 'Москва',
			'178' => 'Санкт-Петербург',
			'186' => 'Ханты-Мансийский АО',
			'190' => 'Московская область',
			'196' => 'Свердловская область',
			'197' => 'Москва',
			'199' => 'Москва',
			'716' => 'Республика Татарстан',
			'750' => 'Московская область',
			'763' => 'Самарская область',
			'777' => 'Москва',
			'799' => 'Москва',
		];
    
		if (array_key_exists($number, $regions))
		{
			return $regions[$number];
		}
		else
		{
			return "Регион не найден";
		}
	}
?>